app/controllers/gatos_controller.rb

  def index
    @gatos = Gato.all
---
SELECT "gatos".* FROM "gatos"

  def create
    @gato = Gato.new(gato_params)
    @gato.user_id = current_user.id

    respond_to do |format|
      if @gato.save
---
INSERT INTO "gatos" ("name", "gender", "race", "color", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "description", "status", "age", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def update
    respond_to do |format|
      if @gato.update(gato_params)
---
UPDATE "gatos" SET "avatar_file_name" = $1, "avatar_content_type" = $2, "avatar_file_size" = $3, "avatar_updated_at" = $4, "description" = $5, "status" = $6, "age" = $7, "updated_at" = $8 WHERE "gatos"."id" = $9

  def destroy
    @gato.destroy
---
DELETE FROM "gatos" WHERE "gatos"."id" = $1  [["id", 1]]

    def set_gato
      @gato = Gato.find(params[:id])
---
SELECT  "gatos".* FROM "gatos" WHERE "gatos"."id" = $1 LIMIT 1  [["id", 21]]