app/controllers/posters_controller.rb

SELECT "posters".* FROM "posters"
---
  def index
    @posters = Poster.all

INSERT INTO "posters" ("description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "Vendo gato lindo"], ["user_id", 3], ["created_at", "2016-12-10 03:48:38.111712"], ["updated_at", "2016-12-10 03:48:38.111712"]]
---
  def create
    @poster = Poster.new(poster_params)
    @poster.user_id = current_user.id

    respond_to do |format|
      if @poster.save

UPDATE "posters" SET "tipo" = $1, "updated_at" = $2 WHERE "posters"."id" = $3  [["tipo", "Venda"], ["updated_at", "2016-12-10 03:49:26.196583"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @poster.update(poster_params)

SELECT  "posters".* FROM "posters" WHERE "posters"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_poster
      @poster = Poster.find(params[:id])