app/controllers/users_controller.rb

  def show
    @user_gatos = @user.gatos.order(:name)
    @user_posters = @user.posters.order(:tipo)
---
SELECT "gatos".* FROM "gatos" WHERE "gatos"."user_id" = $1  ORDER BY "gatos"."name" ASC  [["user_id", 3]]
SELECT "posters".* FROM "posters" WHERE "posters"."user_id" = $1  ORDER BY "posters"."tipo" ASC  [["user_id", 3]]